{
  "version": "Notebook/1.0",
  "items": [
    {
      "type": 1,
      "content": {
        "json": "# Dashboard for NSG flow logs \r\n\r\nIf you find a bug, please open an issue to [kongou-ae/nsgflowlog-dashboard](https://github.com/kongou-ae/nsgflowlog-dashboard/issues)."
      },
      "name": "text - 2"
    },
    {
      "type": 9,
      "content": {
        "version": "KqlParameterItem/1.0",
        "parameters": [
          {
            "id": "ecbe60a5-5e4c-47b7-b2b2-7607343617c8",
            "version": "KqlParameterItem/1.0",
            "name": "Subscription",
            "type": 6,
            "isRequired": true,
            "typeSettings": {
              "additionalResourceOptions": [],
              "includeAll": true
            },
            "timeContext": {
              "durationMs": 86400000
            },
            "value": "/subscriptions/aa9de0c7-adae-4ccc-b041-e4720761aa65"
          },
          {
            "id": "0eb5f393-3971-4506-aad2-9f1a47807ebe",
            "version": "KqlParameterItem/1.0",
            "name": "workspace",
            "type": 5,
            "isRequired": true,
            "query": "resources\r\n| where type == \"microsoft.operationalinsights/workspaces\"",
            "crossComponentResources": [
              "{Subscription}"
            ],
            "typeSettings": {
              "additionalResourceOptions": []
            },
            "timeContext": {
              "durationMs": 86400000
            },
            "queryType": 1,
            "resourceType": "microsoft.resourcegraph/resources",
            "value": "/subscriptions/aa9de0c7-adae-4ccc-b041-e4720761aa65/resourceGroups/labnet/providers/Microsoft.OperationalInsights/workspaces/lab-je-log"
          },
          {
            "id": "5c0b55c5-b6c0-43f1-9481-ae0bfe522071",
            "version": "KqlParameterItem/1.0",
            "name": "TimeRange_p",
            "type": 4,
            "isRequired": true,
            "typeSettings": {
              "selectableValues": [
                {
                  "durationMs": 300000
                },
                {
                  "durationMs": 900000
                },
                {
                  "durationMs": 1800000
                },
                {
                  "durationMs": 3600000
                },
                {
                  "durationMs": 14400000
                },
                {
                  "durationMs": 43200000
                },
                {
                  "durationMs": 86400000
                },
                {
                  "durationMs": 172800000
                },
                {
                  "durationMs": 259200000
                },
                {
                  "durationMs": 604800000
                },
                {
                  "durationMs": 1209600000
                },
                {
                  "durationMs": 2419200000
                },
                {
                  "durationMs": 2592000000
                },
                {
                  "durationMs": 5184000000
                },
                {
                  "durationMs": 7776000000
                }
              ]
            },
            "timeContext": {
              "durationMs": 86400000
            },
            "value": {
              "durationMs": 2592000000
            },
            "label": "TimeRange"
          }
        ],
        "style": "pills",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "パラメーター - 3"
    },
    {
      "type": 9,
      "content": {
        "version": "KqlParameterItem/1.0",
        "parameters": [
          {
            "id": "6fe7638b-0034-440f-8a3c-47e96a4c19f6",
            "version": "KqlParameterItem/1.0",
            "name": "SrcIP_p",
            "label": "SrcIP",
            "type": 1,
            "timeContext": {
              "durationMs": 86400000
            },
            "timeContextFromParameter": "Duration",
            "value": ""
          },
          {
            "id": "c12ff02e-a187-4042-8e1c-2d8a1b598324",
            "version": "KqlParameterItem/1.0",
            "name": "DestIP_p",
            "label": "DestIP",
            "type": 1,
            "timeContext": {
              "durationMs": 86400000
            },
            "timeContextFromParameter": "Duration",
            "value": "52"
          },
          {
            "id": "d2817199-5f21-4885-94e1-73010f6172a3",
            "version": "KqlParameterItem/1.0",
            "name": "Protocol_p",
            "label": "Protocol",
            "type": 2,
            "multiSelect": true,
            "quote": "'",
            "delimiter": ",",
            "value": [
              "value::all"
            ],
            "typeSettings": {
              "additionalResourceOptions": [
                "value::all"
              ],
              "showDefault": false
            },
            "jsonData": "[\r\n    { \"value\":\"ICMP\", \"label\":\"icmp\" },\r\n    { \"value\":\"TCP\", \"label\":\"tcp\" },\r\n    { \"value\":\"UDP\", \"label\":\"udp\"}\r\n]",
            "timeContext": {
              "durationMs": 86400000
            },
            "defaultValue": "value::all"
          },
          {
            "id": "ff7050e4-42f5-4a71-a5ae-e0b993d2249b",
            "version": "KqlParameterItem/1.0",
            "name": "Port_p",
            "label": "Port",
            "type": 1,
            "value": "",
            "timeContext": {
              "durationMs": 1800000
            }
          },
          {
            "id": "4cd12e0e-e88e-49de-8afa-4ab866d5beff",
            "version": "KqlParameterItem/1.0",
            "name": "Status_p",
            "label": "Status",
            "type": 2,
            "multiSelect": true,
            "quote": "'",
            "delimiter": ",",
            "query": "let nsgData = AzureNetworkAnalytics_CL\r\n| extend system = NSGList_s\r\n| extend srcIP = iff(isempty(SrcIP_s), split(SrcPublicIPs_s, \"|\")[0], SrcIP_s)\r\n| extend dstIP = iff(isempty(DestIP_s), split(DestPublicIPs_s, \"|\")[0], DestIP_s)\r\n| extend matchedPolicy = strcat(NSGList_s, \"|\", NSGRule_s)\r\n| extend Status = case(FlowStatus_s == \"A\", \"Accept\", FlowStatus_s == \"D\", \"Deny\", \"unknown\")\r\n| extend Protocol = case(L4Protocol_s == \"T\", \"TCP\", L4Protocol_s == \"U\", \"UDP\", \"unknown\") \r\n| extend DestPort = replace(@'.0',@'',tostring(DestPort_d))\r\n| extend logtime = FlowStartTime_t\r\n| project logtime, system, srcIP, dstIP, Protocol, DestPort, Status, matchedPolicy;\r\nlet nvaData = CommonSecurityLog\r\n| where DeviceVendor == \"Fortinet\"\r\n| parse AdditionalExtensions with * \"cat=\" category \";\" *\r\n| where category == \"traffic:forward\"\r\n| parse AdditionalExtensions with * \"eventtime=\" unixlogtime \";\" *\r\n| parse AdditionalExtensions with * \"policyid=\" matchedPolicy \";\" *\r\n| extend system = DeviceExternalID\r\n| extend logtime = unixtime_seconds_todatetime(toint(unixlogtime))\r\n| extend srcIP = SourceIP\r\n| extend dstIP = DestinationIP\r\n| extend Status = DeviceAction\r\n| extend Protocol = case(Protocol == \"6\", \"TCP\", Protocol == \"17\", \"UDP\", \"others\") \r\n| extend DestPort = tostring(DestinationPort)\r\n| project logtime, system, srcIP, dstIP, Protocol, DestPort, Status, matchedPolicy;\r\nnsgData | union nvaData\r\n| sort by logtime desc\r\n| summarize by Status\r\n",
            "crossComponentResources": [
              "{workspace}"
            ],
            "typeSettings": {
              "additionalResourceOptions": [
                "value::all"
              ],
              "showDefault": false
            },
            "timeContext": {
              "durationMs": 0
            },
            "timeContextFromParameter": "TimeRange_p",
            "defaultValue": "value::all",
            "queryType": 0,
            "resourceType": "microsoft.operationalinsights/workspaces",
            "value": [
              "value::all"
            ]
          }
        ],
        "style": "pills",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "parameters - 2"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "AzureNetworkAnalytics_CL\n| where SubType_s == \"FlowLog\"\n| extend SrcIP = iff(isempty(SrcIP_s), split(SrcPublicIPs_s, \"|\")[0], SrcIP_s)\n| extend DestIP = iff(isempty(DestIP_s), split(DestPublicIPs_s, \"|\")[0], DestIP_s)\n| extend Status = case(FlowStatus_s == \"A\", \"Accept\", FlowStatus_s == \"D\", \"Deny\", \"unknown\")\n| extend Protocol = case(L4Protocol_s == \"T\", \"TCP\", L4Protocol_s == \"U\", \"UDP\", \"unknown\") \n| extend NSGList_s_array = split(NSGList_s,\"/\")\n| extend NsgId = strcat(\"/subscriptions/\", NSGList_s_array[0], \"/resourcegroups/\", NSGList_s_array[1], \"/providers/Microsoft.Network/networkSecurityGroups/\", NSGList_s_array[2]) \n| extend DestPort = replace(@'\\.0',@'', tostring(DestPort_d))\n| project FlowStartTime = FlowStartTime_t, SrcIP, DestIP, Protocol, DestPort, Status, NsgId, NSGRule_s\n| where FlowStartTime {TimeRange_p}\n| where Status in ({Status_p})\n| where SrcIP like '{SrcIP_p}'\n| where DestIP like '{DestIP_p}'\n| where DestPort like '{Port_p}'\n| where Protocol in ({Protocol_p})\n| sort by FlowStartTime desc",
        "size": 0,
        "showAnalytics": true,
        "timeContextFromParameter": "TimeRange_p",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{workspace}"
        ],
        "gridSettings": {
          "rowLimit": 500,
          "sortBy": [
            {
              "itemKey": "FlowStartTime",
              "sortOrder": 1
            }
          ]
        },
        "sortBy": [
          {
            "itemKey": "FlowStartTime",
            "sortOrder": 1
          }
        ]
      },
      "name": "query - 2"
    }
  ],
  "fallbackResourceIds": [
    "Azure Monitor"
  ],
  "$schema": "https://github.com/Microsoft/Application-Insights-Workbooks/blob/master/schema/workbook.json"
}
